export const translations = {
    en: {
      locale: 'en-US',
      messages: {
        headerNav: {
            about: `About`,
            porftfolio: `Portfolio`,
            technologiesStack: `Technologies stack`,
            contacts: `Contacts`
        },
        greetingsLine: {
          first: `HI, Pleasure to meet you 👋`,
          second: `I am Oleg, a Front-end developer with experience in Vanilla JS and ReactJS 💖`,
          third: `Below, you may find more info about me and my projects 👇`,
          fourth: `Hope, you will enjoy them 😎`,
        },
        aboutText: {
          1: `Outsource company or a product one is not a concern to me.`,
          2: `I am looking for the company, that would give me an opportunity to grow and learn.`,
          3: ` The most important moment for me is communication within the development team and
          clients.`,
          4: `Bad management causes a lot of issues, as well as bad code.`,
          5: `Whether I will be coding websites or web services, all I want is to sharpen my skills
          and learn JS with ReactJS on real projects.`,
          6: ` The end goal is to become an outstanding developer, who will participate in difficult
          projects, which will bring profit to a company and satisfaction to me.`
        },
        contacts: {
          profile: `profile`,
          number: `Number:`
        }
      }
    },
    uk: {
      locale: 'uk',
      messages: {
        headerNav: {
            about: 'Про себе',
            porftfolio: `Портфоліо`,
            technologiesStack: `Стек технологій`,
            contacts: `Контакти`
        },
        greetingsLine: {
          first: `Вітаю, радий знайомству 👋`,
          second: `Мене звати Олег, я Фронт-Енд розробник із досвідом роботи з Vanilla JS та ReactJS 💖`,
          third: `Нижче, ви можете дізнатись більше про мене та мої проекти 👇`,
          fourth: `Сподіваюсь, вони вам сподобаються 😎`,
        },
        aboutText: {
          1: `Аутсорс чи продуктова компанія не є надто важливим питанням для мене.`,
          2: `Я шукаю компанію, що надасть мені змогу навчатися та рости як фахівцю.`,
          3: `Найважливішим моментом для мене є комунікація між веб-розробниками та замовниками.`,
          4: `Погана комунікація спричинює так само багато проблем, як і поганий код.`,
          5: `Незалежно від того, чи я буду кодити веб-сервіси чи веб-сайти, все, чого я бажаю - це відточувати свої навички та надалі вивчати JS разом із ReactJS на реальних проектах.`,
          6: `Кінцева мета - стати видатним розробником, який братиме участь у складних проектах, котрі приноситимуть дохід компанії та задоволення мені.`
        },
        contacts: {
          profile: `профіль`,
          number: `Номер:`
        }
      }
    },
    ru: {
        locale: 'ru',
        messages: {
          headerNav: {
              about: 'О себе',
              porftfolio: `Портфолио`,
              technologiesStack: `Стэк технологий`,
              contacts: `Контакты`
          },
          greetingsLine: {
            first: `Привет, рад знакомству 👋`,
            second: `Я Олег, Фронт-Энд разработчик с опытом работы с Vanilla JS и ReactJS 💖`,
            third: `Ниже, вы можете узнать больше про меня и мои проекты 👇`,
            fourth: `Надеюсь, они вам понравятся 😎`,
          },
          aboutText: {
            1: `Аутсорс либо продуктовая компания для меня не так важно.`,
            2: `Я в поисках компании, которая даст мне возможность учиться и расти как специалисту.`,
            3: `Гланым моментом для меня является коммуникация между веб-разработчиками и заказчиками.`,
            4: `Плохая коммуникация может причинить столько же проблем, сколько и плохой код.`,
            5: `Вне зависимости от того, буду ли я кодить веб-сервисы либо веб-сайты, все, чего я желаю - это оттачивать свои навыки и далее изучать JS вместе с ReactJS на реальных проектах.`,
            6: `Конечная цель - стать выдающимся разработчиком, который будет участвовать в сложных проектах, которые принесут прибыль компании и удовлетворение мне.`
          },
          contacts: {
            profile: `профиль`,
            number: `Номер:`
          }
        }
      }
  }